app/controllers/monthly_taglists_controller.rb

  def show
    @mmlog = current_user.monthly_mlogs.find(params[:id])
---
SELECT * FROM "mlogs" WHERE ("mlogs".user_id = 1 AND (date BETWEEN '2009-03-01' AND '2009-03-31' )) ORDER BY date DESC