app/controllers/monthly_mlogs_controller.rb

SELECT * FROM "mlogs" WHERE ("mlogs".user_id = 1 AND (date BETWEEN '2009-03-01' AND '2009-03-31' )) ORDER BY date DESC
---
  def show
    @mmlog = current_user.monthly_mlogs.find(params[:id])