app/controllers/tag_trees_controller.rb

	def show
		if current_user.tag_tree.nil?
      current_user.create_tag_tree
      current_user.tag_tree.save
		end
		@tag_tree = current_user.tag_tree.find_by_tag(params['id'])
---
SELECT * FROM "tag_trees" WHERE ("tag_trees".user_id = 1) LIMIT 1